# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# [Негафибоначчи]
# Пример:
# для k = 8 список будет выглядеть так: 
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]


k = int(input('Введите длину ряда: '))
f1 = f2 = 1
my_List = [f1, f2]

for i in range(2, k):
	f1, f2 = f2, f1 + f2
	my_List.append(f2)
print(my_List)

f1 = f2 = 1
for i in range(-k, 1):
	f1,f2 = f2, f1 - f2
	my_List.insert(0, f2)
print(my_List)
